ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ADC_SAFETY_ADC_SAFETY_502CB400h.xml
<module name="adc_safety" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ADC_SAFETY_CHECKCONFIG" acronym="ADC_SAFETY_CHECKCONFIG" offset="0" width="16" description="ADC Check Configuration Register.">
		<bitfield id="CHKEN" width="1" begin="15" end="15" resetval="0x0" description="Result Safe Check Module enable" range="15" rwaccess="R/W"/>
	<bitfield id="SWSYNC" width="1" begin="6" end="6" resetval="0x0" description="Result Safe Check SW Force Sync." range="6" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="5" begin="4" end="0" resetval="0x0" description="Result Safe Check Sync. In sel " range="4:0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_CHECKSTATUS" acronym="ADC_SAFETY_CHECKSTATUS" offset="4" width="16" description="ADC Check Status Register.">
		<bitfield id="OOT" width="1" begin="2" end="2" resetval="0x0" description="Set when the difference between CHECKRESULT1 and CHECKRESULT2 is greater than TOLERANCE after both results have arrived.   When set, further results will not be captured into the safety checker module CHECKRESULT1 or CHECKRESULT2 registers and further OOT or OVF events can't be generated.  Cleared when the associated OOTx flag for all CPUs are either cleared [via the OOTFLGCLR.OOTx bit] or disabled to all ISR and events [via the CHECKINTSEL3.OOTx, CHECKEVT1SEL3.OOTx, CHECKEVT2SEL3.OOTx, CHECKEVT3SEL3.OOTx, and CHECKEVT4SEL3.OOTx registers]   " range="2" rwaccess="R"/>
	<bitfield id="RES2READY" width="1" begin="1" end="1" resetval="0x0" description="Result Safe Check Result 2 arrived. Cleared automatically when both results have arrived and the comparison occurs.  Can also be cleared by issuing a software sync to the tile via the CHECKCONFIG.SWSYNC field.   " range="1" rwaccess="R"/>
	<bitfield id="RES1READY" width="1" begin="0" end="0" resetval="0x0" description="Result Safe Check Result 1 arrived.  Cleared automatically when both results have arrived and the comparison occurs. Can also be cleared by issuing a software sync to the tile via the CHECKCONFIG.SWSYNC field. " range="0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_ADCRESSEL1" acronym="ADC_SAFETY_ADCRESSEL1" offset="8" width="16" description="ADC Check 1 Select Register.">
		<bitfield id="ADCRESULTSEL" width="6" begin="9" end="4" resetval="0x0" description="ADC Result Safety Checker Result Select 1  0 = ADCRESULT0 1 = ADCRESULT1 2= ADCRESULT2 3 = ADCRESULT3 4 = ADCRESULT4 5 = ADCRESULT5 6 = ADCRESULT6 7 = ADCRESULT7 8 = ADCRESULT8 9 = ADCRESULT9 10 = ADCRESULT10 11 = ADCRESULT11 12 = ADCRESULT12 13 = ADCRESULT13 14 = ADCRESULT14 15 = ADCRESULT15 16 = RESERVED 17 = RESERVED 18 = RESERVED 19 = RESERVED 20 = RESERVED 21 = RESERVED 22 = RESERVED 23 = RESERVED 24 = RESERVED 25 = RESERVED 26 = RESERVED 27 = RESERVED 28 = RESERVED 29 = RESERVED 30 = RESERVED 31 = RESERVED 32 = ADCPPBRESULT1 33 = ADCPPBRESULT2 34 = ADCPPBRESULT3 35 = ADCPPBRESULT4 36 = ADCPPBSUM1 37 = ADCPPBSUM2 38 = ADCPPBSUM3 39 = ADCPPBSUM4 ... 40 - 61 = Reserved" range="9:4" rwaccess="R/W"/>
	<bitfield id="ADCSEL" width="3" begin="2" end="0" resetval="0x0" description="ADC Result Safety Checker ADC Select 1   0 = ADC-0 1 = ADC-1 2 = ADC-2 3 = ADC-3 4 = ADC-45 - 7 = Reserved" range="2:0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_ADCRESSEL2" acronym="ADC_SAFETY_ADCRESSEL2" offset="12" width="16" description="ADC Check 2 Select Register.">
		<bitfield id="ADCRESULTSEL" width="6" begin="9" end="4" resetval="0x0" description="ADC Result Safety Checker Result Select 2  0 = ADCRESULT0 1 = ADCRESULT1 2= ADCRESULT2 3 = ADCRESULT3 4 = ADCRESULT4 5 = ADCRESULT5 6 = ADCRESULT6 7 = ADCRESULT7 8 = ADCRESULT8 9 = ADCRESULT9 10 = ADCRESULT10 11 = ADCRESULT11 12 = ADCRESULT12 13 = ADCRESULT13 14 = ADCRESULT14 15 = ADCRESULT15 16 = RESERVED 17 = RESERVED 18 = RESERVED 19 = RESERVED 20 = RESERVED 21 = RESERVED 22 = RESERVED 23 = RESERVED 24 = RESERVED 25 = RESERVED 26 = RESERVED 27 = RESERVED 28 = RESERVED 29 = RESERVED 30 = RESERVED 31 = RESERVED 32 = ADCPPBRESULT1 33 = ADCPPBRESULT2 34 = ADCPPBRESULT3 35 = ADCPPBRESULT4 36 = ADCPPBSUM1 37 = ADCPPBSUM2 38 = ADCPPBSUM3 39 = ADCPPBSUM4 ... 40 - 61 = Reserved" range="9:4" rwaccess="R/W"/>
	<bitfield id="ADCSEL" width="3" begin="2" end="0" resetval="0x0" description="ADC Result Safety Checker ADC Select 2   0 = ADC-0 1 = ADC-1 2 = ADC-2 3 = ADC-3 4 = ADC-4 5 - 7 = Reserved" range="2:0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_TOLERANCE" acronym="ADC_SAFETY_TOLERANCE" offset="16" width="32" description="ADC Check Tolerance Register.">
		<bitfield id="TOLERANCE" width="24" begin="23" end="0" resetval="0x0" description="Tolerance for the difference between CHECKRESULT1 and CHECKRESULT2.    If the difference is greater than [but not equal to] the tolerance, an out-of-tolerance event will be generated, indicated the compared ADC results are not within expected tolerance of each other. " range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_CHECKRESULT1" acronym="ADC_SAFETY_CHECKRESULT1" offset="24" width="32" description="ADC Check Captured Result 1 .">
		<bitfield id="RESULT" width="24" begin="23" end="0" resetval="0x0" description="ADC Result Safety Checker Captured Result Result that was captured   In the case that multiple results arrive for one selected result before one result arrives for the other result for comparison, the RES1OVF flag in CHECKSTATUS will be set.  This does not prevent CHECKRESULT1 from updating to the latest result.  " range="23:0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_CHECKRESULT2" acronym="ADC_SAFETY_CHECKRESULT2" offset="28" width="32" description="ADC Check Captured Result 2 .">
		<bitfield id="RESULT" width="24" begin="23" end="0" resetval="0x0" description="ADC Result Safety Checker Captured Result Result that was captured   In the case that multiple results arrive for one selected result before one result arrives for the other result for comparison, the RES2OVF flag in CHECKSTATUS will be set.  This does not prevent CHECKRESULT2 from updating to the latest result.  " range="23:0" rwaccess="R"/>
	</register>
</module>